# ContainsKey Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable..::..ContainsKey Method
ExportFontTable Class See Also
---
Checks whether a font key exists in the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ContainsKey(
	ExportFontKey exportfontKey
)
```

Visual Basic
---
```text
Public Function ContainsKey ( _
	exportfontKey As ExportFontKey _
) As Boolean
```

Visual C++
---
```text
public:
bool ContainsKey(
	ExportFontKey^ exportfontKey
)
```

# ### Parameters
exportfontKey
    Type: Autodesk.Revit.DB..::..ExportFontKey The export font Key.
# ### Return Value
True if the font key exists in the table.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace